class Solution(object):
    def countBits(self, num):
        """
        :type num: int
        :rtype: List[int]
        """

        # 这道题给我们一个整数n，然我们统计从0到n每个数的二进制写法的1的个数，存入一个一维数组中返回，
        # 题目中明确表示不希望我们一个数一个数的傻算，而是希望我们找出规律，而且题目中也提示了我们注意
        # [2-3], [4-7], [8-15]这些区间的规律，那么我们写出0到15的数的二进制和1的个数如下:

        # 0    0000    0
        # -------------
        # 1    0001    1
        # -------------
        # 2    0010    1
        # 3    0011    2
        # -------------
        # 4    0100    1
        # 5    0101    2
        # 6    0110    2
        # 7    0111    3
        # -------------
        # 8    1000    1
        # 9    1001    2
        # 10   1010    2
        # 11   1011    3
        # 12   1100    2
        # 13   1101    3
        # 14   1110    3
        # 15   1111    4

        # 递推式：ans[n] = ans[n >> 1] + (n & 1)

        ans = [0]
        for x in range(1, num + 1):
            ans.append(ans[x/2] + (x & 1))

        return ans
